src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательСотрудник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПисьмаНапоминанияПоДоставкеИзделий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьПФМ15</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПортала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСотрудникаНаПортале</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоКомпании</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинНаПортале</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>22</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимДоступаККомпаниям</name>
    <type>
      <types>EnumRef.Scan_РежимДоступаПользователяККомпаниям</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДилера</name>
    <comment>(scania)</comment>
    <type>
      <types>EnumRef.Scan_ВидыДилеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/Scan_ПараметрыДокумента/Module.bsl
//rarus sergei 29.06.2016 mantis 6976 ++

// Обработчик события возникающего на клиенте при нажатии кнопки "Применить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Применить(Команда)
		
	// Производим формирование полной даты документа
	//ЭтаФорма.Дата = ТекущаяДата();
	
	// Инициализируем переменные нужные для анализа изменений в форме
	ИзмененныеРеквизиты = Новый Структура;
	
	// Производим анализа изменений внесенных пользователем в форму
	Для Каждого Реквизит Из Элементы Цикл
		Если ТипЗнч(Реквизит)=Тип("ПолеФормы") И Реквизит.Видимость И ЭтотОбъект.КопияОбъекта.Свойство(Реквизит.Имя) И (НЕ ЭтаФорма[Реквизит.Имя]=ЭтотОбъект.КопияОбъекта[Реквизит.Имя]) Тогда
			ИзмененныеРеквизиты.Вставить(Реквизит.Имя, ЭтаФорма[Реквизит.Имя]);
		КонецЕсли;
	КонецЦикла;
	
	// Проверим корректность заполнения формы
	Если (НЕ ПроверитьЗаполнение()) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим значение измененных реквизитов документа
	ПараметрыЗакрытия = Новый Структура();
	ПараметрыЗакрытия.Вставить("ИзмененныеРеквизиты",          ИзмененныеРеквизиты);
	ПараметрыЗакрытия.Вставить("ПоказыватьПараметрыДокумента", ЭтаФорма.ПоказыватьПараметрыДокумента);
	// Закрываем форму параметров
	ЭтаФорма.Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Производим чтение основных входных параметров
	ВладелецОбъект               = Параметры.Объект;
	МетаданныеОбъекта            = Параметры.Объект.Ссылка.Метаданные();
	ИмяОбъекта                   = МетаданныеОбъекта.Имя;
	ИмяОбъектаБезПрефикса        = МетаданныеОбъекта.Синоним;
	Операция                     = Параметры.Операция;
	ПоказыватьПараметрыДокумента = Параметры.ПоказыватьПараметрыДокумента;
	
	
	// Восстановим параметры отображения диалога для текущей операции
	ЭтаФорма.КлючСохраненияПоложенияОкна = Операция;
	
	// Произведем добавление реквизита формы описывающего объект подобный владельцу
	ДобавляемыеРеквизиты = Новый Массив();
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДокументОбъект", Новый ОписаниеТипов("ДокументОбъект."+ИмяОбъекта)));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КопияОбъекта",   Новый ОписаниеТипов("ДокументОбъект."+ИмяОбъекта)));
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ИсходныйОбъект = ДанныеФормыВЗначение(ВладелецОбъект, Тип("ДокументОбъект."+ИмяОбъекта));
	ЗначениеВРеквизитФормы(ИсходныйОбъект, "ДокументОбъект");
	ЗначениеВРеквизитФормы(ИсходныйОбъект, "КопияОбъекта");
	Дата                    = ВладелецОбъект.Дата;	
	Автор                   = ВладелецОбъект.Автор;
	ПодразделениеКомпании   = ВладелецОбъект.ПодразделениеКомпании;
	Организация             = ВладелецОбъект.Организация;  
	Менеджер                = ВладелецОбъект.Менеджер; 
	ДатаСозданияДокумента   = ВладелецОбъект.ДатаСоздания;
	ДатаПроведенияДокумента = ВладелецОбъект.ДатаПроведения;
	Номер                   = ВладелецОбъект.Номер;
	ВалютаДокумента			= ВладелецОбъект.ВалютаДокумента;
	ШтрихКод                = ВладелецОбъект.ШтрихКод;
	//rarus vikhle 20.04.2020 mt 15695 +++
	Компания				= ВладелецОбъект.Компания;
	Контрагент				= ВладелецОбъект.Контрагент;
	//rarus vikhle 20.04.2020 mt 15695 ---
	//rarus BProg_Gladkov 01.12.2019 0014560 ++
	Элементы.ВалютаДокумента.ТолькоПросмотр = Параметры.ЗапретитьИзменение_ВалютаДокумента;
	//rarus BProg_Gladkov 01.12.2019 0014560 -- 
	
	//rarus sergei 17.08.2016 mantis 7122 ++
	Попытка
		ДокументОснование       = ВладелецОбъект.ДокументОснование;
	Исключение
	КонецПопытки;
	//rarus sergei 17.08.2016 mantis 7122 --

	//rarus tenkam 07.10.2016 mantis 7122 ++
	//ЭтаФорма.Заголовок = "Параметры: "+ИмяОбъектаБезПрефикса+" " + Операция;
	ЭтаФорма.Заголовок = "Параметры: "+ИмяОбъектаБезПрефикса+" ХО: " + Операция;
	//rarus tenkam 07.10.2016 mantis 7122 --
	
	// rarus agar 22.12.2022 19668 ++
	//Если не ЗначениеЗаполнено(ВладелецОбъект.Ссылка) Тогда
	//	Элементы.ПодразделениеКомпании.Доступность = Ложь;
	//	Элементы.Организация.Доступность = Ложь;
	//КонецЕсли;
	// rarus agar 22.12.2022 19668 --
	
	//rarus vikhle 22.11.2021 m 18340 +++
	Если Параметры.Свойство("ДоступностьДаты") Тогда
		Элементы.Дата.ТолькоПросмотр = НЕ Параметры.ДоступностьДаты;
	КонецЕсли;	
	//rarus vikhle 22.11.2021 m 18340 ---
	
	// rarus agar 13.12.2022 19668 ++
	РазрешитьРедактированиеПараметров = Scan_ПраваИНастройки.Scan_Право("РазрешитьРедактированиеПараметровДокументов");
	
	Элементы.ПодразделениеКомпании.ТолькоПросмотр = Не РазрешитьРедактированиеПараметров;
	Элементы.Организация.ТолькоПросмотр = Не РазрешитьРедактированиеПараметров;
	Элементы.Менеджер.ТолькоПросмотр = Не РазрешитьРедактированиеПараметров;
	
	// rarus agar 13.12.2022 19668 --
	
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	МенеджерПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура МенеджерПриИзмененииНаСервере()
	Если не Менеджер.Пустая() Тогда
		Организация = Менеджер.Организация;
		ПодразделениеКомпании = Менеджер.ПодразделениеОрганизации;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеКомпанииПриИзменении(Элемент)
	ПодразделениеКомпанииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделениеКомпанииПриИзмененииНаСервере()
	Если не ПодразделениеКомпании.Пустая() Тогда
		Организация = ПодразделениеКомпании.Владелец;
		// rarus agar 16.12.2022 19668 ++
		//Менеджер = Справочники.Пользователи.ПустаяСсылка();
		// rarus agar 16.12.2022 19668 --
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	ПодразделениеКомпании = Справочники.Scan_Подразделения.ПустаяСсылка();
	// rarus agar 16.12.2022 19668 ++
	//Менеджер = Справочники.Пользователи.ПустаяСсылка();
	// rarus agar 16.12.2022 19668 --
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Владелец", Организация);
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
	    Результат = ОткрытьФорму("Справочник.Scan_Подразделения.ФормаВыбора",ПараметрыФормы,Элементы.ПодразделениеКомпании); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МенеджерНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
		ЗначениеОтбора = Новый Структура("Организация", Организация);
		Если ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
			ЗначениеОтбора.Вставить("ПодразделениеОрганизации",ПодразделениеКомпании);	
		КонецЕсли;
		ПараметрыФормы = Новый Структура("Отбор", ЗначениеОтбора);
		Результат = ОткрытьФорму("Справочник.Пользователи.Форма.ФормаВыбора",ПараметрыФормы,Элементы.Менеджер);
	КонецЕсли;
	
КонецПроцедуры





//rarus sergei 29.06.2016 mantis 6976 ++
